piaoxuebingfeng/esp32-gamepad-retro-go-ST7789/components/retro-go/rg_system.c
#include "rg_system.h"
#include "rg_printf.h"

#include <sys/stat.h>
#include <sys/time.h>
#include <stdarg.h>
#include <assert.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>

#ifndef RG_TARGET_SDL2
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <freertos/task.h>
#include <esp_heap_caps.h>
#include <esp_partition.h>
#include <esp_ota_ops.h>
#include <esp_system.h>
#include <esp_timer.h>
#include <esp_sleep.h>
#include <driver/gpio.h>
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include <esp_chip_info.h>
#endif
#else
#include <SDL2/SDL.h>
#endif

#define RG_LOGBUF_SIZE 2048
typedef struct
{
    char buffer[RG_LOGBUF_SIZE];
    size_t cursor;
} logbuf_t;

#define RG_STRUCT_MAGIC 0x12345678
typedef struct
{
    uint32_t magicWord;
    char message[256];
    char context[128];
    rg_stats_t statistics;
    logbuf_t logbuf;
} panic_trace_t;

typedef struct
{
    int32_t totalFrames, fullFrames, ticks;
    int64_t busyTime, updateTime;
} counters_t;

typedef struct
{
    TaskHandle_t handle;
    char name[20];
} rg_task_t;

#ifdef RG_ENABLE_PROFILING
typedef struct
{
    void *func_ptr, *caller_ptr;
    int32_t num_calls, run_time;
    int64_t enter_time;
} profile_frame_t;

static struct
{
    int64_t time_started;
    int32_t total_frames;
    SemaphoreHandle_t lock;
    profile_frame_t frames[512];
} *profile;
#endif

// The trace will survive a software reset
static RTC_NOINIT_ATTR panic_trace_t panicTrace;
static RTC_NOINIT_ATTR time_t rtcValue;
static rg_stats_t statistics;
static rg_app_t app;
static logbuf_t logbuf;
static rg_task_t tasks[8];
static int ledValue = -1;
static int wdtCounter = 0;
static bool exitCalled = false;

static const char *SETTING_BOOT_NAME = "BootName";
static const char *SETTING_BOOT_ARGS = "BootArgs";
static const char *SETTING_BOOT_FLAGS = "BootFlags";
static const char *SETTING_TIMEZONE = "Timezone";

#define WDT_TIMEOUT 10000000
#define WDT_RELOAD(val) wdtCounter = (val)

#define logbuf_putc(buf, c) (buf)->buffer[(buf)->cursor++] = c, (buf)->cursor %= RG_LOGBUF_SIZE;
#define logbuf_puts(buf, str) for (const char *ptr = str; *ptr; ptr++) logbuf_putc(buf, *ptr);


void rg_system_load_time(void)
{
    time_t time_sec = RG_MAX(rtcValue, RG_BUILD_TIME);
    FILE *fp;
#if 0
    if (rg_i2c_read(0x68, 0x00, data, sizeof(data)))
    {
        RG_LOGI("Time loaded from DS3231\n");
    }
    else
#endif
    if ((fp = fopen(RG_BASE_PATH_CACHE "/clock.bin", "rb")))
    {
        fread(&time_sec, sizeof(time_sec), 1, fp);
        fclose(fp);
        RG_LOGI("Time loaded from storage\n");
    }
#ifndef RG_TARGET_SDL2
    settimeofday(&(struct timeval){time_sec, 0}, NULL);
#endif
    time_sec = time(NULL); // Read it back to be sure it worked
    RG_LOGI("Time is now: %s\n", asctime(localtime(&time_sec)));
}

void rg_system_save_time(void)
{
    time_t time_sec = time(NULL);
    FILE *fp;
    // We always save to storage in case the RTC disappears.
    if ((fp = fopen(RG_BASE_PATH_CACHE "/clock.bin", "wb")))
    {
        fwrite(&time_sec, sizeof(time_sec), 1, fp);
        fclose(fp);
        RG_LOGI("System time saved to storage.\n");
    }
#if 0
    if (rg_i2c_write(0x68, 0x00, data, sizeof(data)))
    {
        RG_LOGI("System time saved to DS3231.\n");
    }
#endif
}

void rg_system_set_timezone(const char *TZ)
{
    rg_settings_set_string(NS_GLOBAL, SETTING_TIMEZONE, TZ);
    setenv("TZ", TZ, 1);
    tzset();
}

static inline void begin_panic_trace(const char *context, const char *message)
{
    panicTrace.magicWord = RG_STRUCT_MAGIC;
    panicTrace.statistics = statistics;
    panicTrace.logbuf = logbuf;
    strncpy(panicTrace.message, message ?: "(none)", sizeof(panicTrace.message) - 1);
    strncpy(panicTrace.context, context ?: "(none)", sizeof(panicTrace.context) - 1);
    panicTrace.message[sizeof(panicTrace.message) - 1] = 0;
    panicTrace.context[sizeof(panicTrace.context) - 1] = 0;
    logbuf_puts(&panicTrace.logbuf, "\n\n*** PANIC TRACE: ***\n\n");
}

IRAM_ATTR void esp_panic_putchar_hook(char c)
{
    if (panicTrace.magicWord != RG_STRUCT_MAGIC)
        begin_panic_trace("esp_panic", NULL);
    logbuf_putc(&panicTrace.logbuf, c);
}

static void update_memory_statistics(void)
{
#ifndef RG_TARGET_SDL2
    multi_heap_info_t heap_info;

    heap_caps_get_info(&heap_info, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    statistics.freeMemoryInt = heap_info.total_free_bytes;
    statistics.freeBlockInt = heap_info.largest_free_block;
    statistics.totalMemoryInt = heap_info.total_free_bytes + heap_info.total_allocated_bytes;
    heap_caps_get_info(&heap_info, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    statistics.freeMemoryExt = heap_info.total_free_bytes;
    statistics.freeBlockExt = heap_info.largest_free_block;
    statistics.totalMemoryExt = heap_info.total_free_bytes + heap_info.total_allocated_bytes;

    statistics.freeStackMain = uxTaskGetStackHighWaterMark(tasks[0].handle);
#endif
}

static void update_statistics(void)
{
    static counters_t counters = {0};
    const counters_t previous = counters;

    rg_display_counters_t display = rg_display_get_counters();
    // rg_audio_counters_t audio = rg_audio_get_counters();

    counters.totalFrames = display.totalFrames;
    counters.fullFrames = display.fullFrames;
    counters.busyTime = statistics.busyTime;
    counters.ticks = statistics.ticks;
    counters.updateTime = rg_system_timer();

    float elapsedTime = (counters.updateTime - previous.updateTime) / 1000000.f;
    statistics.busyPercent = RG_MIN((counters.busyTime - previous.busyTime) / (elapsedTime * 1000000.f) * 100.f, 100.f);
    statistics.totalFPS = (counters.ticks - previous.ticks) / elapsedTime;
    statistics.skippedFPS = statistics.totalFPS - ((counters.totalFrames - previous.totalFrames) / elapsedTime);
    statistics.fullFPS = (counters.fullFrames - previous.fullFrames) / elapsedTime;

    update_memory_statistics();
}

static void system_monitor_task(void *arg)
{
    int64_t lastLoop = rg_system_timer();
    int32_t numLoop = 0;
    float batteryPercent = 0.f;
    bool ledState = false;

    // Give the app a few seconds to start before monitoring
    rg_task_delay(2500);
    WDT_RELOAD(WDT_TIMEOUT);

    while (!exitCalled)
    {
        int loopTime_us = lastLoop - rg_system_timer();
        lastLoop = rg_system_timer();
        rtcValue = time(NULL);

        // Maybe we should *try* to wait for vsync before updating?
        update_statistics();

