piaoxuebingfeng/esp32-gamepad-retro-go-ST7789/components/retro-go/rg_system.c
        if (rg_input_read_battery(&batteryPercent, NULL))
        {
            if (batteryPercent < 2)
                rg_system_set_led((ledState ^= 1));
            else if (ledState)
                rg_system_set_led((ledState = 0));
        }

        RG_LOGX("STACK:%d, HEAP:%d+%d (%d+%d), BUSY:%.2f, FPS:%.2f (SKIP:%d, PART:%d, FULL:%d), BATT:%.2f\n",
            statistics.freeStackMain,
            statistics.freeMemoryInt / 1024,
            statistics.freeMemoryExt / 1024,
            statistics.freeBlockInt / 1024,
            statistics.freeBlockExt / 1024,
            statistics.busyPercent,
            statistics.totalFPS,
            (int)(statistics.skippedFPS + 0.9f),
            (int)(statistics.totalFPS - statistics.skippedFPS - statistics.fullFPS + 0.9f),
            (int)(statistics.fullFPS + 0.9f),
            batteryPercent);

        if ((wdtCounter -= loopTime_us) <= 0)
        {
            if (rg_input_gamepad_last_read() > WDT_TIMEOUT)
            {
            #ifdef RG_ENABLE_PROFILING
                RG_LOGW("Application unresponsive!\n");
            #else
                RG_PANIC("Application unresponsive!");
            #endif
            }
            WDT_RELOAD(WDT_TIMEOUT);
        }

        #ifdef RG_ENABLE_PROFILING
            if ((numLoop % 10) == 0)
                rg_system_dump_profile();
        #endif

        // if ((numLoop % 300) == 299)
        // {
        //     RG_LOGI("Saving system time");
        //     rg_system_save_time();
        // }

        rg_task_delay(1000);
        numLoop++;
    }

    rg_task_delete(NULL);
}

static void enter_recovery_mode(void)
{
    RG_LOGW("Entering recovery mode...\n");

    const rg_gui_option_t options[] = {
        {0, "Reset all settings", NULL, 1, NULL},
        {1, "Reboot to factory ", NULL, 1, NULL},
        {2, "Reboot to launcher", NULL, 1, NULL},
        RG_DIALOG_CHOICE_LAST,
    };
    while (true)
    {
        switch (rg_gui_dialog("Recovery mode", options, -1))
        {
        case 0:
            rg_storage_delete(RG_BASE_PATH_CONFIG);
            rg_storage_delete(RG_BASE_PATH_CACHE);
            rg_settings_reset();
            break;
        case 1:
            rg_system_switch_app(RG_APP_FACTORY, RG_APP_FACTORY, 0, 0);
        case 2:
        default:
            rg_system_switch_app(RG_APP_FACTORY, RG_APP_LAUNCHER, 0, 0);
        }
    }
}

static void setup_gpios(void)
{
// At boot time those pins are muxed to JTAG and can interfere with other things.
#if CONFIG_IDF_TARGET_ESP32
    gpio_reset_pin(GPIO_NUM_12);
    gpio_reset_pin(GPIO_NUM_13);
    gpio_reset_pin(GPIO_NUM_14);
    gpio_reset_pin(GPIO_NUM_15);
#endif
    //test
    printf("\n========================================================\n");
    printf("beep close\r\n");
    gpio_set_direction(GPIO_NUM_13, GPIO_MODE_OUTPUT);
    gpio_set_level(GPIO_NUM_13, 0);
    printf("\n========================================================\n");
#ifndef RG_TARGET_SDL2
    if (RG_GPIO_LED != GPIO_NUM_NC)
        gpio_set_direction(RG_GPIO_LED, GPIO_MODE_OUTPUT);
#endif
}

rg_app_t *rg_system_reinit(int sampleRate, const rg_handlers_t *handlers, const rg_gui_option_t *options)
{
    if (!app.initialized)
        return rg_system_init(sampleRate, handlers, options);

    app.sampleRate = sampleRate;
    if (handlers)
        app.handlers = *handlers;
    app.options = options;
    tasks[0].handle = xTaskGetCurrentTaskHandle();
    rg_audio_set_sample_rate(app.sampleRate);

    return &app;
}

rg_app_t *rg_system_init(int sampleRate, const rg_handlers_t *handlers, const rg_gui_option_t *options)
{
    RG_ASSERT(app.initialized == false, "rg_system_init() was already called.");
    const esp_app_desc_t *esp_app = esp_ota_get_app_description();

    app = (rg_app_t){
        .name = esp_app->project_name,
        .version = esp_app->version,
        .buildDate = esp_app->date,
        .buildTime = esp_app->time,
        .buildUser = RG_BUILD_USER,
        .toolchain = esp_get_idf_version(),
        .bootArgs = NULL,
        .bootFlags = 0,
        .bootType = RG_RST_POWERON,
        .speed = 1.f,
        .refreshRate = 60,
        .sampleRate = sampleRate,
        .logLevel = RG_LOG_INFO,
        .options = options, // TO DO: We should make a copy of it?
    };

    tasks[0] = (rg_task_t){xTaskGetCurrentTaskHandle(), "main"};

    // Do this very early, may be needed to enable serial console
    setup_gpios();

    printf("\n========================================================\n");
    printf("%s %s (%s %s)\n", app.name, app.version, app.buildDate, app.buildTime);
    printf(" built for: %s. aud=%d disp=%d pad=%d sd=%d cfg=%d\n", RG_TARGET_NAME, 0, 0, 0, 0, 0);
    printf("========================================================\n\n");

#ifndef RG_TARGET_SDL2
    esp_reset_reason_t r_reason = esp_reset_reason();
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);
    RG_LOGI("Chip info: model %d rev%d (%d cores), reset reason: %d\n",
        chip_info.model, chip_info.revision, chip_info.cores, r_reason);
    if (r_reason == ESP_RST_PANIC || r_reason == ESP_RST_TASK_WDT || r_reason == ESP_RST_INT_WDT)
        app.bootType = RG_RST_PANIC;
    else if (r_reason == ESP_RST_SW)
        app.bootType = RG_RST_RESTART;
#endif

    update_memory_statistics();
    RG_LOGI("Internal memory: free=%d, total=%d\n", statistics.freeMemoryInt, statistics.totalMemoryInt);
    RG_LOGI("External memory: free=%d, total=%d\n", statistics.freeMemoryExt, statistics.totalMemoryExt);

    rg_system_set_led(0);

    // Storage must be initialized first (SPI bus, settings, assets, etc)
    rg_storage_init();

    if ((app.isLauncher = strcmp(app.name, RG_APP_LAUNCHER) == 0))
    {
        app.configNs = app.name;
    }
    else
    {
        app.configNs = rg_settings_get_string(NS_BOOT, SETTING_BOOT_NAME, app.name);
        app.bootArgs = rg_settings_get_string(NS_BOOT, SETTING_BOOT_ARGS, "");
        app.bootFlags = rg_settings_get_number(NS_BOOT, SETTING_BOOT_FLAGS, 0);
        app.saveSlot = (app.bootFlags & RG_BOOT_SLOT_MASK) >> 4;
        app.romPath = app.bootArgs;
    }

