piaoxuebingfeng/esp32-gamepad-retro-go-ST7789/components/retro-go/rg_system.c
    rg_input_init(); // Must be first for the qtpy (input -> aw9523 -> lcd)
    rg_display_init();
    rg_gui_init();

    // Test for recovery request as early as possible
    for (int timeout = 5, btn; (btn = rg_input_read_gamepad() & RG_RECOVERY_BTN) && timeout >= 0; --timeout)
    {
        RG_LOGW("Button " PRINTF_BINARY_16 " being held down...\n", PRINTF_BINVAL_16(btn));
        rg_task_delay(100);
        if (timeout == 0)
            enter_recovery_mode();
    }

    rg_gui_draw_hourglass();
    rg_audio_init(sampleRate);

    // Show alert if we've just rebooted from a panic
    if (app.bootType == RG_RST_PANIC)
    {
        char message[400] = "Application crashed";

        if (panicTrace.magicWord == RG_STRUCT_MAGIC)
        {
            RG_LOGI("Panic log found, saving to sdcard...\n");
            if (panicTrace.message[0] && strcmp(panicTrace.message, "(none)") != 0)
                strcpy(message, panicTrace.message);

            if (rg_system_save_trace(RG_STORAGE_ROOT "/crash.log", 1))
                strcat(message, "\nLog saved to SD Card.");
        }

        RG_LOGW("Aborting: panic!\n");
        rg_display_clear(C_BLUE);
        rg_gui_alert("System Panic!", message);
        rg_system_switch_app(RG_APP_LAUNCHER, 0, 0, 0);
    }
    panicTrace.magicWord = 0;

#ifndef RG_TARGET_SDL2
    if (app.bootFlags & RG_BOOT_ONCE)
        esp_ota_set_boot_partition(esp_partition_find_first(
            ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, RG_APP_LAUNCHER));
#endif

    rg_system_set_timezone(rg_settings_get_string(NS_GLOBAL, SETTING_TIMEZONE, "EST+5"));
    rg_system_load_time();

    // Do these last to not interfere with panic handling above
    if (handlers)
        app.handlers = *handlers;

    #ifdef RG_ENABLE_PROFILING
    RG_LOGI("Profiling has been enabled at compile time!\n");
    profile = rg_alloc(sizeof(*profile), MEM_SLOW);
    profile->lock = xSemaphoreCreateMutex();
    #endif

    rg_task_create("rg_system", &system_monitor_task, NULL, 3 * 1024, RG_TASK_PRIORITY, -1);

    app.initialized = true;

    RG_LOGI("Retro-Go ready.\n\n");

    return &app;
}

bool rg_task_create(const char *name, void (*taskFunc)(void *data), void *data, size_t stackSize, int priority, int affinity)
{
    RG_ASSERT(name && taskFunc, "bad param");
    TaskHandle_t handle = NULL;

#ifndef RG_TARGET_SDL2
    if (affinity < 0)
        affinity = tskNO_AFFINITY;
    if (xTaskCreatePinnedToCore(taskFunc, name, stackSize, data, priority, &handle, affinity) != pdPASS)
        handle = NULL; // should already be NULL...
#else
    if ((handle = SDL_CreateThread(taskFunc, name, data)))
        SDL_DetachThread(handle);
#endif

    if (!handle)
    {
        RG_LOGE("Task creation failed: name='%s', fn='%p', stack=%d\n", name, taskFunc, stackSize);
        return false;
    }

    for (size_t i = 0; i < RG_COUNT(tasks); ++i)
    {
        if (tasks[i].handle == NULL)
        {
            tasks[i].handle = handle;
            strncpy(tasks[i].name, name, 20);
            return true;
        }
    }

    RG_LOGW("Task queue full! Task '%s' is running but not tracked...\n", name);
    return true;
}

bool rg_task_delete(const char *name)
{
    TaskHandle_t current = xTaskGetCurrentTaskHandle();
    for (size_t i = 0; i < RG_COUNT(tasks); ++i)
    {
        if ((!name && tasks[i].handle == current) || (name && strncmp(tasks[i].name, name, 20) != 0))
        {
        #ifndef RG_TARGET_SDL2
            vTaskDelete(tasks[i].handle);
        #endif
            tasks[i].handle = NULL;
            return true;
        }
    }
    return false;
}

void rg_task_delay(int ms)
{
    // Note: rg_task_delay MUST yield at least once, even if ms = 0
    // Keep in mind that delay may not be very accurate, use usleep().
#ifndef RG_TARGET_SDL2
    vTaskDelay(pdMS_TO_TICKS(ms));
#else
    SDL_PumpEvents();
    SDL_Delay(ms);
#endif
}

rg_app_t *rg_system_get_app(void)
{
    return &app;
}

rg_stats_t rg_system_get_counters(void)
{
    return statistics;
}

IRAM_ATTR void rg_system_tick(int busyTime)
{
    statistics.busyTime += busyTime;
    statistics.ticks++;
    // WDT_RELOAD(WDT_TIMEOUT);
}

IRAM_ATTR int64_t rg_system_timer(void)
{
#ifndef RG_TARGET_SDL2
    return esp_timer_get_time();
#else
    return SDL_GetTicks() * 1000;
#endif
}

void rg_system_event(int event, void *arg)
{
    RG_LOGD("Dispatching event:%d arg:%p\n", event, arg);
    if (app.handlers.event)
        app.handlers.event(event, arg);
}

char *rg_emu_get_path(rg_path_type_t pathType, const char *filename)
{
    char *buffer = malloc(RG_PATH_MAX + 1);
    int type = pathType & ~0xFF;
    int slot = pathType & 0xFF;

    if (!buffer)
        RG_PANIC("Out of memory!");

    if (type == RG_PATH_SAVE_STATE || type == RG_PATH_SAVE_SRAM)
        strcpy(buffer, RG_BASE_PATH_SAVES);
    else if (type == RG_PATH_SCREENSHOT)
        strcpy(buffer, RG_BASE_PATH_SAVES);
    else if (type == RG_PATH_ROM_FILE)
        strcpy(buffer, RG_BASE_PATH_ROMS);
    else if (type == RG_PATH_CACHE_FILE)
        strcpy(buffer, RG_BASE_PATH_CACHE);
    else
        strcpy(buffer, RG_STORAGE_ROOT);

    if (filename != NULL)
    {
        // Often filename will be an absolute ROM, let's remove that part!
        if (strstr(filename, RG_BASE_PATH_ROMS) == filename)
            filename += strlen(RG_BASE_PATH_ROMS) + 1;

        // TO DO: We probably should append app->name when needed...

        strcat(buffer, "/");
        strcat(buffer, filename);

        if (slot > 0)
            sprintf(buffer + strlen(buffer), "-%d", slot);

        if (type == RG_PATH_SAVE_STATE)
            strcat(buffer, ".sav");
        else if (type == RG_PATH_SAVE_SRAM)
            strcat(buffer, ".sram");
        else if (type == RG_PATH_SCREENSHOT)
            strcat(buffer, ".png");
    }

    // Don't shrink the buffer, we could use the extra space (append extension, etc).
    return buffer;
}

static void emu_update_save_slot(uint8_t slot)
{
    static uint8_t last_written = 0xFF;
    if (slot != last_written)
    {
        char *filename = rg_emu_get_path(RG_PATH_SAVE_STATE + 0xFF, app.romPath);
        FILE *fp = fopen(filename, "wb");
        if (fp)
        {
            fwrite(&slot, 1, 1, fp);
            fclose(fp);
            last_written = slot;
        }
        free(filename);
    }
    app.saveSlot = slot;

    // Set bootflags to resume from this state on next boot
    if ((app.bootFlags & RG_BOOT_ONCE) == 0)
    {
        app.bootFlags &= ~RG_BOOT_SLOT_MASK;
        app.bootFlags |= app.saveSlot << 4;
        app.bootFlags |= RG_BOOT_RESUME;
        rg_settings_set_number(NS_BOOT, SETTING_BOOT_FLAGS, app.bootFlags);
    }

    rg_storage_commit();
}

bool rg_emu_load_state(uint8_t slot)
{
    bool success = false;

