piaoxuebingfeng/esp32-gamepad-retro-go-ST7789/components/retro-go/rg_system.c
    if (!app.romPath || !app.handlers.loadState)
    {
        RG_LOGE("No rom or handler defined...\n");
        return false;
    }

    char *filename = rg_emu_get_path(RG_PATH_SAVE_STATE + slot, app.romPath);
    RG_LOGI("Loading state from '%s'.\n", filename);
    WDT_RELOAD(30 * 1000000);

    rg_gui_draw_hourglass();

    if (!(success = (*app.handlers.loadState)(filename)))
    {
        RG_LOGE("Load failed!\n");
    }
    else
    {
        emu_update_save_slot(slot);
    }

    WDT_RELOAD(WDT_TIMEOUT);
    free(filename);

    return success;
}

bool rg_emu_save_state(uint8_t slot)
{
    if (!app.romPath || !app.handlers.saveState)
    {
        RG_LOGE("No rom or handler defined...\n");
        return false;
    }

    char *filename = rg_emu_get_path(RG_PATH_SAVE_STATE + slot, app.romPath);
    char tempname[RG_PATH_MAX + 8];
    bool success = false;

    RG_LOGI("Saving state to '%s'.\n", filename);
    WDT_RELOAD(30 * 1000000);

    rg_system_set_led(1);
    rg_gui_draw_hourglass();

    if (!rg_storage_mkdir(rg_dirname(filename)))
    {
        RG_LOGE("Unable to create dir, save might fail...\n");
    }

    #define tempname(ext) strcat(strcpy(tempname, filename), ext)

    if ((*app.handlers.saveState)(tempname(".new")))
    {
        rename(filename, tempname(".bak"));

        if (rename(tempname(".new"), filename) == 0)
        {
            unlink(tempname(".bak"));
            success = true;
        }
    }

    if (!success)
    {
        RG_LOGE("Save failed!\n");
        rename(filename, tempname(".bak"));
        unlink(tempname(".new"));
        rg_gui_alert("Save failed", NULL);
    }
    else
    {
        // Save succeeded, let's take a pretty screenshot for the launcher!
        char *filename = rg_emu_get_path(RG_PATH_SCREENSHOT + slot, app.romPath);
        rg_emu_screenshot(filename, rg_display_get_info()->screen.width / 2, 0);
        free(filename);

        emu_update_save_slot(slot);
    }

    #undef tempname
    free(filename);

    rg_storage_commit();
    rg_system_set_led(0);

    WDT_RELOAD(WDT_TIMEOUT);

    return success;
}

bool rg_emu_screenshot(const char *filename, int width, int height)
{
    if (!app.handlers.screenshot)
    {
        RG_LOGE("No handler defined...\n");
        return false;
    }

    RG_LOGI("Saving screenshot %dx%d to '%s'.\n", width, height, filename);

    if (!rg_storage_mkdir(rg_dirname(filename)))
    {
        RG_LOGE("Unable to create dir, save might fail...\n");
    }

    // FIXME: We should allocate a framebuffer to pass to the handler and ask it
    // to fill it, then we'd resize and save to png from here...
    bool success = (*app.handlers.screenshot)(filename, width, height);

    rg_storage_commit();

    return success;
}

rg_emu_state_t *rg_emu_get_states(const char *romPath, size_t slots)
{
    rg_emu_state_t *result = calloc(1, sizeof(rg_emu_state_t) + sizeof(rg_emu_slot_t) * slots);
    uint8_t last_used_slot = 0xFF;

    char *filename = rg_emu_get_path(RG_PATH_SAVE_STATE + 0xFF, romPath);
    FILE *fp = fopen(filename, "rb");
    if (fp)
    {
        fread(&last_used_slot, 1, 1, fp);
        fclose(fp);
    }
    free(filename);

    for (size_t i = 0; i < slots; i++)
    {
        rg_emu_slot_t *slot = &result->slots[i];
        char *preview = rg_emu_get_path(RG_PATH_SCREENSHOT + i, romPath);
        char *file = rg_emu_get_path(RG_PATH_SAVE_STATE + i, romPath);
        struct stat st;
        strcpy(slot->preview, preview);
        strcpy(slot->file, file);
        slot->id = i;
        slot->exists = stat(slot->file, &st) == 0;
        slot->mtime = st.st_mtime;
        if (slot->exists)
        {
            if (!result->latest || slot->mtime > result->latest->mtime)
                result->latest = slot;
            if (slot->id == last_used_slot)
                result->lastused = slot;
            result->used++;
        }
        free(preview);
        free(file);
    }
    if (!result->lastused && result->latest)
        result->lastused = result->latest;
    result->total = slots;

    return result;
}

bool rg_emu_reset(bool hard)
{
    if (app.handlers.reset)
        return app.handlers.reset(hard);
    return false;
}

static void shutdown_cleanup(void)
{
    rg_display_clear(C_BLACK);                // Let the user know that something is happening
    rg_gui_draw_hourglass();                  // ...
    rg_system_event(RG_EVENT_SHUTDOWN, NULL); // Allow apps to save their state if they want
    rg_audio_deinit();                        // Disable sound ASAP to avoid audio garbage
    rg_system_save_time();                    // RTC might save to storage, do it before
    rg_storage_deinit();                      // Unmount storage
    rg_input_wait_for_key(RG_KEY_ALL, false); // Wait for all keys to be released (boot is sensitive to GPIO0,32,33)
    rg_input_deinit();                        // Now we can shutdown input
    rg_i2c_deinit();                          // Must be after input, sound, and rtc
    rg_display_deinit();                      // Do this very last to reduce flicker time
}

void rg_system_shutdown(void)
{
    RG_LOGI("Halting system.\n");
    exitCalled = true;
    shutdown_cleanup();
    vTaskSuspendAll();
    while (1)
        ;
}

void rg_system_sleep(void)
{
    RG_LOGI("Going to sleep!\n");
    exitCalled = true;
    shutdown_cleanup();
    rg_task_delay(1000);
    esp_deep_sleep_start();
}

void rg_system_restart(void)
{
    RG_LOGI("Restarting system.\n");
    exitCalled = true;
    shutdown_cleanup();
    esp_restart();
}

void rg_system_switch_app(const char *partition, const char *name, const char *args, uint32_t flags)
{
    RG_LOGI("Switching to app %s (%s)!\n", partition, name ?: "-");
    exitCalled = true;

    if (app.initialized)
    {
        rg_settings_set_string(NS_BOOT, SETTING_BOOT_NAME, name);
        rg_settings_set_string(NS_BOOT, SETTING_BOOT_ARGS, args);
        rg_settings_set_number(NS_BOOT, SETTING_BOOT_FLAGS, flags);
        rg_settings_commit();
    }

