piaoxuebingfeng/esp32-gamepad-retro-go-ST7789/components/retro-go/rg_system.c
    esp_err_t err = esp_ota_set_boot_partition(esp_partition_find_first(
            ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, partition));
    if (err != ESP_OK)
    {
        RG_LOGE("esp_ota_set_boot_partition returned 0x%02X!\n", err);
        RG_PANIC("Unable to set boot app!");
    }

    rg_system_restart();
}

bool rg_system_have_app(const char *app)
{
    return esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, app) != NULL;
}

void rg_system_panic(const char *context, const char *message)
{
    // Call begin_panic_trace first, it will normalize context and message for us
    begin_panic_trace(context, message);
    // Avoid using printf functions in case we're crashing because of a busted stack
    fputs("\n*** RG_PANIC() CALLED IN '", stdout);
    fputs(panicTrace.context, stdout);
    fputs("' ***\n*** ", stdout);
    fputs(panicTrace.message, stdout);
    fputs(" ***\n\n", stdout);
    abort();
}

void rg_system_vlog(int level, const char *context, const char *format, va_list va)
{
    const char *levels[RG_LOG_MAX] = {NULL, "=", "error", "warn", "info", "debug"};
    char buffer[300];
    size_t len = 0;

    if (app.logLevel && level > app.logLevel)
        return;

    if (level > RG_LOG_PRINT && level < RG_LOG_MAX)
    {
        if (levels[level])
            len += sprintf(buffer + len, "[%s] ", levels[level]);
        if (context)
            len += sprintf(buffer + len, "%s: ", context);
    }

    len += vsnprintf(buffer + len, sizeof(buffer) - len, format, va);

    // Append a newline if needed only when possible
    if (len > 0 && buffer[len - 1] != '\n')
    {
        buffer[len++] = '\n';
        buffer[len] = 0;
    }

    logbuf_puts(&logbuf, buffer);
    fputs(buffer, stdout);

    #ifdef RG_TARGET_SDL2
    fflush(stdout);
    #endif
}

void rg_system_log(int level, const char *context, const char *format, ...)
{
    va_list va;
    va_start(va, format);
    rg_system_vlog(level, context, format, va);
    va_end(va);
}

bool rg_system_save_trace(const char *filename, bool panic_trace)
{
    RG_ASSERT(filename, "bad param");

    rg_stats_t *stats = panic_trace ? &panicTrace.statistics : &statistics;
    logbuf_t *log = panic_trace ? &panicTrace.logbuf : &logbuf;

    RG_LOGI("Saving debug trace to '%s'...\n", filename);
    FILE *fp = fopen(filename, "w");
    if (fp)
    {
        fprintf(fp, "Application: %s (%s)\n", app.name, app.configNs);
        fprintf(fp, "Version: %s\n", app.version);
        fprintf(fp, "Build date: %s %s\n", app.buildDate, app.buildTime);
        fprintf(fp, "Toolchain: %s\n", app.toolchain);
        fprintf(fp, "Total memory: %d + %d\n", stats->totalMemoryInt, stats->totalMemoryExt);
        fprintf(fp, "Free memory: %d + %d\n", stats->freeMemoryInt, stats->freeMemoryExt);
        fprintf(fp, "Free block: %d + %d\n", stats->freeBlockInt, stats->freeBlockExt);
        fprintf(fp, "Stack HWM: %d\n", stats->freeStackMain);
        fprintf(fp, "Uptime: %ds (%d ticks)\n", (int)(rg_system_timer() / 1000000), stats->ticks);
        if (panic_trace && panicTrace.message[0])
            fprintf(fp, "Panic message: %.256s\n", panicTrace.message);
        if (panic_trace && panicTrace.context[0])
            fprintf(fp, "Panic context: %.256s\n", panicTrace.context);
        fputs("\nLog output:\n", fp);
        for (size_t i = 0; i < RG_LOGBUF_SIZE; i++)
        {
            size_t index = (log->cursor + i) % RG_LOGBUF_SIZE;
            if (log->buffer[index])
                fputc(log->buffer[index], fp);
        }
        fputs("\n\nEnd of trace\n\n", fp);
        fclose(fp);
    }

    return (fp != NULL);
}

void rg_system_set_led(int value)
{
#ifndef RG_TARGET_SDL2
    if (RG_GPIO_LED > -1 && ledValue != value)
        gpio_set_level(RG_GPIO_LED, value);
#endif
    ledValue = value;
}

int rg_system_get_led(void)
{
    return ledValue;
}

// Note: You should use calloc/malloc everywhere possible. This function is used to ensure
// that some memory is put in specific regions for performance or hardware reasons.
// Memory from this function should be freed with free()
void *rg_alloc(size_t size, uint32_t caps)
{
#ifndef RG_TARGET_SDL2
    char caps_list[36] = {0};
    uint32_t esp_caps = 0;
    void *ptr;

    esp_caps |= (caps & MEM_SLOW ? MALLOC_CAP_SPIRAM : (caps & MEM_FAST ? MALLOC_CAP_INTERNAL : 0));
    esp_caps |= (caps & MEM_DMA ? MALLOC_CAP_DMA : 0);
    esp_caps |= (caps & MEM_EXEC ? MALLOC_CAP_EXEC : 0);
    esp_caps |= (caps & MEM_32BIT ? MALLOC_CAP_32BIT : MALLOC_CAP_8BIT);

    if (esp_caps & MALLOC_CAP_SPIRAM)   strcat(caps_list, "SPIRAM|");
    if (esp_caps & MALLOC_CAP_INTERNAL) strcat(caps_list, "INTERNAL|");
    if (esp_caps & MALLOC_CAP_DMA)      strcat(caps_list, "DMA|");
    if (esp_caps & MALLOC_CAP_EXEC)     strcat(caps_list, "IRAM|");
    strcat(caps_list, (esp_caps & MALLOC_CAP_32BIT) ? "32BIT" : "8BIT");

    if ((ptr = heap_caps_calloc(1, size, esp_caps)))
    {
        RG_LOGI("SIZE=%u, CAPS=%s, PTR=%p\n", size, caps_list, ptr);
        return ptr;
    }

    size_t available = heap_caps_get_largest_free_block(esp_caps);
    // Loosen the caps and try again
    if ((ptr = heap_caps_calloc(1, size, esp_caps & ~(MALLOC_CAP_SPIRAM | MALLOC_CAP_INTERNAL))))
    {
        RG_LOGW("SIZE=%u, CAPS=%s, PTR=%p << CAPS not fully met! (available: %d)\n",
                    size, caps_list, ptr, available);
        return ptr;
    }

    RG_LOGE("SIZE=%u, CAPS=%s << FAILED! (available: %d)\n", size, caps_list, available);
    RG_PANIC("Memory allocation failed!");
#else
    return calloc(1, size);
#endif
}

#ifdef RG_ENABLE_PROFILING
// Note this profiler might be inaccurate because of:
// https://gcc.gnu.org/bugzilla/show_bug.cgi?id=28205

// We also need to add multi-core support. Currently it's not an issue
// because all our profiled code runs on the same core.

#define LOCK_PROFILE()   xSemaphoreTake(lock, pdMS_TO_TICKS(10000));
#define UNLOCK_PROFILE() xSemaphoreGive(lock);

NO_PROFILE static inline profile_frame_t *find_frame(void *this_fn, void *call_site)
{
    for (int i = 0; i < 512; ++i)
    {
        profile_frame_t *frame = &profile->frames[i];
        if (frame->func_ptr == 0)
        {
            profile->total_frames = RG_MAX(profile->total_frames, i + 1);
            frame->func_ptr = this_fn;
        }
        if (frame->func_ptr == this_fn) // && frame->caller_ptr == call_site)
            return frame;
    }

    RG_PANIC("Profile memory exhausted!");
}

NO_PROFILE void rg_system_dump_profile(void)
{
    LOCK_PROFILE();

    printf("RGD:PROF:BEGIN %d %d\n", profile->total_frames, (int)(rg_system_timer() - profile->time_started));

    for (int i = 0; i < profile->total_frames; ++i)
    {
        profile_frame_t *frame = &profile->frames[i];

        printf(
            "RGD:PROF:DATA %p\t%p\t%u\t%u\n",
            frame->caller_ptr,
            frame->func_ptr,
            frame->num_calls,
            frame->run_time
        );
    }

    printf("RGD:PROF:END\n");

    memset(profile->frames, 0, sizeof(profile->frames));
    profile->time_started = rg_system_timer();
    profile->total_frames = 0;

    UNLOCK_PROFILE();
}

NO_PROFILE void __cyg_profile_func_enter(void *this_fn, void *call_site)
{
    if (!profile)
        return;

    int64_t now = rg_system_timer();
    LOCK_PROFILE();
    profile_frame_t *fn = find_frame(this_fn, call_site);
    // Recursion will need a real stack, this is absurd
    if (fn->enter_time != 0)
        fn->run_time += now - fn->enter_time;
    fn->enter_time = rg_system_timer(); // not now, because we delayed execution
    fn->num_calls++;
    UNLOCK_PROFILE();
}

NO_PROFILE void __cyg_profile_func_exit(void *this_fn, void *call_site)
{
    if (!profile)
        return;

    int64_t now = rg_system_timer();
    LOCK_PROFILE();
    profile_frame_t *fn = find_frame(this_fn, call_site);
    // Ignore if profiler was disabled when function entered
    if (fn->enter_time != 0)
        fn->run_time += now - fn->enter_time;
    fn->enter_time = 0;
    UNLOCK_PROFILE();
}
#endif
